# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

# TODO: your code here

def distance(x1, y1, x2, y2, r1, r2):
    length = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    if r1 > length and r1 >= r2 + length:
        print('Одна окружность вписана в другую')
    else:
        print('Одна окружность НЕ вписана в другую')

distance(5, 5, 7, 4.2, 5, 12)
