# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    # TODO: your code here
    pass


# Пример вызова функции
can_triangle((10, 12), (14, 18), (12, 12))

# Не забудьте протестировать вашу функцию

# на листочке нарисовал и проверил) треугольник не получается если сумма длинн двух сторон из трёх равна третьей.


def can_triangle(p1, p2, p3):
    length1 = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5
    length2 = ((p3[0] - p1[0]) ** 2 + (p3[1] - p1[1]) ** 2) ** 0.5
    length3 = ((p3[0] - p2[0]) ** 2 + (p3[1] - p2[1]) ** 2) ** 0.5
    if length1 + length2 != length3 and length2 + length3 != length1 and length1 + length3 != length2:
        print('Треугольник ОК')
    else:
        print('Треугольник не получается-прямая линия')

# Пример вызова функции
can_triangle((3, 7), (4, 4), (5, 1))

# Треугольник не получается-прямая линия
