# Напишите функцию принимающую время в секундах и возвращающую строку формата: “hh:mm:ss”,
# где hh - часы, mm- минуты, ss - секунды.
# Пример:
# 29143 секунд → 08:05:43

def time(n):
    s = n % 60
    h = n // 3600
    m = (n - h * 3600 - s) // 60
    return "%02d:%02d:%02d" % (h, m, s)

time(26984)
# print('Время: ', time(26984))
