# Даны два уравнения прямых вида у=kx+b и виде строки. Проверить, пересекаются ли данные прямые?
# Примеры уравнений: "y = 2x + 4"  "y = -12x -12"

# Проверьте входные данные на корректность

try:
    a = 'y = 2x + 4'
    a1 = 'y = -12x -12'
    b = a.split()
    k = int((b[2].split('x'))[0])
    b1 = a1.split()
    k1 = int((b1[2].split('x'))[0])
    # print(b)
    # print(k)
    # print(b1)
    # print(k1)

    if k != k1:
        print('прямые пересекаются')
    else:
        print('прямые НЕпересекаются')
except ValueError:
    print('В условии есть буква.Переделай условие.')
