# Является ли палиндромом?
# Напишите функцию, проверяющую является ли число палиндромом.
# палиндром - число одинаково читающееся слева направо, так и справа налево.
#  Пример палиндрома: 12321

def palindrome(number):
    pass

def palindrome(number):
    if str(number) == str(number)[::-1]:
        print('Палиндром ОК')
    else:
        print('Палиндром НЕ ОК')

palindrome(100001)
