# Найдите количество чисел являющихся палиндромами в диапазоне от a до b включительно
# Известно, что a и b целые положительные числа.

a = ...
b = ...

def palindrome(a, b):
    i = 0  # счетчик
    while a <= b:
        if str(a) == str(a)[::-1]:
            i += 1
        a += 1
    print(i)

palindrome(10, 98)
