# Иван кладет в банк x рублей под a процентов годовых на n лет. Напишите функцию, которая возвращает число -
# сколько денег получит Иван в результате.

def deposit(x, a, n):
    pass
# функция принимает три числа и возвращает одно - итоговая сумма на счету Ивана.
# Проценты на вклад начисляются один раз в год.

def deposit(x, a, n):
    i = 1
    sum = x
    while i <= n:
        sum = sum + sum * a * 0.01
        i += 1
    print(f'Иван получит: {round(sum, 2)} рублей')


deposit(100, 8.6, 12)  # вклад, процент, кол-во лет
